In [3]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\duplicate.xlsx')
df=pd.DataFrame(d)
print(df)

       Name  English  Maths  Science  Total
0     Honey       95     90       94    279
1     Dolly       90     99       96    285
2       TSR       60     80       70    210
3  Chinnari       65     55       80    200
4    Aadhya       88     94       99    281
5   Gulshan       92     95       95    282
6    Sowmya       80     60       90    230
7   Deepthi       80     70       85    235
8     Arjun       90     90       90    270
9    Shanvi       98     97       96    291

In [4]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [5]:
df.drop_duplicates()

       Name  English  Maths  Science  Total
0     Honey       95     90       94    279
1     Dolly       90     99       96    285
2       TSR       60     80       70    210
3  Chinnari       65     55       80    200
4    Aadhya       88     94       99    281
5   Gulshan       92     95       95    282
6    Sowmya       80     60       90    230
7   Deepthi       80     70       85    235
8     Arjun       90     90       90    270
9    Shanvi       98     97       96    291

In [7]:
import pandas as pd
d=pd.read_excel(r'C:\Users\user\Desktop\duplicate.xlsx')
df=pd.DataFrame(d)
print(df)
print("\n")
df.drop_duplicates(inplace=True)
print(df)

       Name  English  Maths  Science  Total
0     Honey       95     90       94    279
1     Dolly       90     99       96    285
2       TSR       60     80       70    210
3  Chinnari       65     55       80    200
4    Aadhya       88     94       99    281
5   Gulshan       92     95       95    282
6    Sowmya       80     60       90    230
7   Deepthi       80     70       85    235
8     Arjun       90     90       90    270
9    Shanvi       98     97       96    291


       Name  English  Maths  Science  Total
0     Honey       95     90       94    279
1     Dolly       90     99       96    285
2       TSR       60     80       70    210
3  Chinnari       65     55       80    200
4    Aadhya       88     94       99    281
5   Gulshan       92     95       95    282
6    Sowmya       80     60       90    230
7   Deepthi       80     70       85    235
8     Arjun       90     90       90    270
9    Shanvi       98     97       96    291